{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 705], "trainable": true, "name": "dense", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 100, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "dtype": "float32", "noise_shape": null, "seed": null, "name": "dropout"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "trainable": true, "name": "dense_1", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 50, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "dtype": "float32", "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "trainable": true, "name": "dense_2", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 10, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "trainable": true, "name": "dense_3", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1, "use_bias": true}}], "name": "sequential"}, "keras_version": "2.1.6-tf"}